// 01_数组.cpp : 定义控制台应用程序的入口点。
//

#include "stdafx.h"


int _tmain(int argc, _TCHAR* argv[])
{
	//定义并初始化数组
	int Array[5] = { 1, 2, 3, 4, 5 };//定义5个元素的数组，并初始化

	int a = 5;
	
	//int Array1[a];                 //错误的，数组长度必须是常量
	//Array[5] = { 1, 2, 3, 4, 5 };  //错误的，不能整体赋值
	//Array = { 1, 2, 3, 4, 5 };     //错误的，数组名是一个常量，不能赋值
	int Array2[] = { 1, 2, 3, 4, 5, 6 };//正确的，当初始化时，数组元素个数确定时
	                                 //数组长度可以省略
	//int Array3[];//错误的，假如要省略数组长度，必须初始化。
	Array[0] = 10;
	Array[1] = 20;
	Array[2] = 30;
	Array[3] = 40;
	Array[4] = 50;
	//Array[7] = 60;//数组下标应该只到4，但是C语言不会检测下标越界，十分容易造成溢出
	printf("%d", Array[0]);
	scanf_s("%d", &Array[0]);
	return 0;
}

